## 1. Importing

In [6]:
import pandas as pd
import numpy as np

In [7]:
dataSet1 = pd.read_csv('spam.csv', encoding='ISO-8859-1')

In [22]:
dataSet1.sample(5)

,v1,v2,Unnamed: 2,Unnamed: 3,Unnamed: 4
1413,spam,Dear U've been invited to XCHAT. This is our f...,NaN,NaN,NaN
655,ham,Tell them the drug dealer's getting impatient,NaN,NaN,NaN
1445,ham,I am in a marriage function,NaN,NaN,NaN
3913,ham,Today is ACCEPT DAY..U Accept me as? Brother S...,NaN,NaN,NaN
3895,spam,tells u 2 call 09066358152 to claim å£5000 pri...,NaN,NaN,NaN

In [24]:
dataSet1.shape

(5572, 5)

## 2. Data Cleaning

In [25]:
dataSet1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5572 entries, 0 to 5571
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   v1          5572 non-null   object
 1   v2          5572 non-null   object
 2   Unnamed: 2  50 non-null     object
 3   Unnamed: 3  12 non-null     object
 4   Unnamed: 4  6 non-null      object
dtypes: object(5)
memory usage: 217.8+ KB

In [27]:
#Dropping last 3 columns because it have more missing values

In [10]:
dataSet1.drop(columns=['Unnamed: 2','Unnamed: 3','Unnamed: 4'],inplace=True)

In [11]:
dataSet1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5572 entries, 0 to 5571
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   v1      5572 non-null   object
 1   v2      5572 non-null   object
dtypes: object(2)
memory usage: 87.2+ KB

In [34]:
dataSet1.sample(10)

        v1                                                 v2
1188   ham  All will come alive.better correct any good lo...
3017   ham       I didn't get the second half of that message
4800   ham  The guy at the car shop who was flirting with ...
1384   ham  Storming msg: Wen u lift d phne, u say \HELLO\...
2282   ham                      Whom you waited for yesterday
4829   ham  The word \Checkmate\" in chess comes from the ...
443    ham                             Sorry, I'll call later
2298   ham  Dont pick up d call when something important i...
4498  spam  SMS SERVICES. for your inclusive text credits,...
3321   ham  Ok darlin i supose it was ok i just worry too ...

In [ ]:
#renaming the columns because v1 and v2 is not understandable

In [13]:
dataSet1.rename(columns={'v1':'target','v2':'text'},inplace=True)

In [14]:
dataSet1.sample(5)

     target                                               text
1060    ham  I'm working technical support :)voice process....
4693    ham  Pls give her the food preferably pap very slow...
990     ham                                       26th OF JULY
2284    ham                            Velly good, yes please!
3830    ham  Let's pool our money together and buy a bunch ...

In [39]:
from sklearn.preprocessing import LabelEncoder
encoder = LabelEncoder()

In [42]:
encoder.fit_transform(dataSet1['target'])

array([0, 0, 1, ..., 0, 0, 0])

In [43]:
dataSet1['target'] = encoder.fit_transform(dataSet1['target'])

In [44]:
dataSet1.sample(5)

      target                                               text
4962       0                 I want to see your pretty pussy...
1190       0                                      We're done...
4747       0  The beauty of life is in next second.. which h...
276        0             Tell rob to mack his gf in the theater
3071       0                             Ok lor... But buy wat?

In [8]:
dataSet1.head()

,v1,v2,Unnamed: 2,Unnamed: 3,Unnamed: 4
0,ham,"Go until jurong point, crazy.. Available only ...",NaN,NaN,NaN
1,ham,Ok lar... Joking wif u oni...,NaN,NaN,NaN
2,spam,Free entry in 2 a wkly comp to win FA Cup fina...,NaN,NaN,NaN
3,ham,U dun say so early hor... U c already then say...,NaN,NaN,NaN
4,ham,"Nah I don't think he goes to usf, he lives aro...",NaN,NaN,NaN

# Cheking if there is null value or not

In [18]:
dataSet1.isnull().sum()

target    0
text      0
dtype: int64

In [16]:
dataSet1.head()

  target                                               text
0    ham  Go until jurong point, crazy.. Available only ...
1    ham                      Ok lar... Joking wif u oni...
2   spam  Free entry in 2 a wkly comp to win FA Cup fina...
3    ham  U dun say so early hor... U c already then say...
4    ham  Nah I don't think he goes to usf, he lives aro...

# Cheking if there is duplicate value or not

In [21]:
dataSet1.duplicated().sum()

403

In [23]:
# removing duplicates
dataSet1=dataSet1.drop_duplicates(keep= 'first')

In [24]:
dataSet1.duplicated().sum()

0

In [26]:
dataSet1.shape

(5169, 2)

# 3. EDA (Exploratory Data Analysis)